; Mathematical symbols
; Many from block U+2200 ("Mathematical Operators")
; https://compart.com/en/unicode/block/U+2200

; Circled numerals
:*:@@(0)::🄋 ; U+1F10B
:*:@@(1)::➀ ; U+2780
:*:@@(2)::➁ ; U+2781
:*:@@(3)::➂ ; U+2782
:*:@@(4)::➃ ; U+2783
:*:@@(5)::➄ ; U+2784
:*:@@(6)::➅ ; U+2785
:*:@@(7)::➆ ; U+2786
:*:@@(8)::➇ ; U+2787
:*:@@(9)::➈ ; U+2788
:*:@@(10)::➉ ; U+2780

; Superscripts
:*:@@^1::¹
:*:@@^2::²
:*:@@^3::³
:*:@@^4::⁴
:*:@@^5::⁵
:*:@@^6::⁶
:*:@@^7::⁷
:*:@@^8::⁸
:*:@@^9::⁹

; Expressions
:*:@@empty::∅ ; U+2205
:*:@@infinity::∞ ; U+221E

; Unary Operators
:*:@@partial::∂ ; U+2202
:*:@@change::∆ ; U+2206
:*:@@nabla::∇ ; U+2207
:*:@@integral::∫ ; U+222B
:*:@@1'::′ ; U+2032
:*:@@2'::″ ; U+2033
:*:@@3'::‴ ; U+2034

; Operators
:*:@@+-::± ; U+00B1
:*:@@-+::∓ ; U+2213
:*:@@cap::∩ ; U+2229
:*:@@cup::∪ ; U+222A
:*:@@scap::⊓ ; U+2293
:*:@@scup::⊔ ; U+2294
:*:@@op*::∗ ; U+2217
:*:@@opo::∘ ; U+2218
:*:@@op.::∙ ; U+2219
:*:@@op5::⋆ ; U+22C6
:*:@@opo+::⊕ ; U+2295
:*:@@opox::⊗ ; U+2297
:*:@@prod::∏ ; U+220F
:*:@@sum::∑ ; U+2211

; Relations
:*:@@~=::≈ ; U+2248
:*:@@?=::≟ ; U+225F
:*:@@!=::≠ ; U+2260
:*:@@equiv::≡ ; U+2261
:*:@@leq::≤ ; U+2264
:*:@@geq::≥ ; U+2265
:*:@@lll::≪ ; U+226A
:*:@@ggg::≫ ; U+226B
:*:@@comp::⋚ ; U+22DA

:*:@@element::∈ ; U+2208
:*:@@!element::∉ ; U+2209
:*:@@psubset::⊂ ; U+2282
:*:@@subset::⊆ ; U+2286
:*:@@psubg::⊲ ; U+22B2
:*:@@subg::⊴ ; U+22B4
:*:@@bowtie::⋈ ; U+22C8

:*:@@divides::∣ ; U+2223
:*:@@!divides::∤ ; U+2224

:*:@@parallel::∥ ; U+2225
:*:@@!parallel::∦ ; U+2226

:*:@@prop::∝ ; U+221D

; Delimiters
:*:@@[^::⌈ ; U+2308
:*:@@]^::⌉ ; U+2309
:*:@@[v::⌊ ; U+230A
:*:@@]v::⌋ ; U+230B

; Other
:*:@@|...::⋮ ; U+22EE
:*:@@-...::⋯ ; U+22EF
:*:@@angle::∠ ; U+2220
:*:@@qed::∎ ; U+220E

; Logic
:*:@@therefore::∴ ; U+2234
:*:@@implies::⇒ ; U+21D2
:*:@@iff::⇔ ; U+21D4
:*:@@not::¬ ; U+00AC
:*:@@and::∧ ; U+2227
:*:@@or::∨ ; U+2228
:*:@@xor::⊻ ; U+22BB
:*:@@nand::⊼ ; U+22BC
:*:@@top::⊤ ; U+22A4
:*:@@bot::⊥ ; U+22A5
:*:@@forall::∀ ; U+2200
:*:@@exists::∃ ; U+2203
:*:@@!exists::∄ ; U+2204
:*:@@might::◇ ; U+25C7
:*:@@must::◻ ; U+25FB
:*:@@assert::⊢ ; U+22A2
:*:@@precedes::≺ ; U+227A
:*:@@relates::⊰ ; U+22B0
